Eddddddddy/SolderingPen_2.0/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino.cpp
# 1 "C:\\Users\\benji\\AppData\\Local\\Temp\\tmpi_1ym_a1"
#include <Arduino.h>
# 1 "D:/Documents/Songguo-PTS200/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino"

#include "config.h"


#include <Button2.h>
#include <QC3Control.h>


#include "FirmwareMSC.h"
#include "Languages.h"
#include "USB.h"
#include "UtilsEEPROM.h"

QC3Control QC(14, 13);


#include <U8g2lib.h>

#include "PTS200_16.h"



#include <ESP32AnalogRead.h>

#include "esp_adc_cal.h"

#ifdef U8X8_HAVE_HW_SPI
#include <SPI.h>
#endif
#ifdef U8X8_HAVE_HW_I2C
#include <Wire.h>
#endif

#include <PID_v1.h>


#include <EEPROM.h>



#define LIS 






#include "SparkFun_LIS2DH12.h"
SPARKFUN_LIS2DH12 accel;





int16_t gx = 0, gy = 0, gz = 0;
uint16_t accels[32][3];
uint8_t accelIndex = 0;
#define ACCEL_SAMPLES 32


double aggKp = 11, aggKi = 0.5, aggKd = 1;
double consKp = 11, consKi = 3, consKd = 5;


uint16_t DefaultTemp = TEMP_DEFAULT;
uint16_t SleepTemp = TEMP_SLEEP;
uint8_t BoostTemp = TEMP_BOOST;
uint16_t time2sleep = TIME2SLEEP;
uint8_t time2off = TIME2OFF;
uint8_t timeOfBoost = TIMEOFBOOST;
uint8_t MainScrType = MAINSCREEN;
bool PIDenable = PID_ENABLE;
bool beepEnable = BEEP_ENABLE;
volatile uint8_t VoltageValue = VOLTAGE_VALUE;
bool QCEnable = QC_ENABLE;
uint8_t WAKEUPthreshold = WAKEUP_THRESHOLD;
bool restore_default_config = false;


uint16_t CalTemp[TIPMAX][4] = {TEMP200, TEMP280, TEMP360, TEMPCHP};
char TipName[TIPMAX][TIPNAMELENGTH] = {TIPNAME};
uint8_t CurrentTip = 0;
uint8_t NumberOfTips = 1;


volatile uint8_t a0, b0, c0, d0;
volatile bool ab0;
volatile int count, countMin, countMax, countStep;
volatile bool handleMoved;


uint16_t SetTemp, ShowTemp, gap, Step;
double Input, Output, Setpoint, RawTemp, CurrentTemp, ChipTemp;


uint16_t Vcc, Vin;


bool inLockMode = true;
bool inSleepMode = false;
bool inOffMode = false;
bool inBoostMode = false;
bool inCalibMode = false;
bool isWorky = true;
bool beepIfWorky = true;
bool TipIsPresent = true;
bool OledClear;


uint32_t sleepmillis;
uint32_t boostmillis;
uint32_t buttonmillis;
uint32_t goneMinutes;
uint32_t goneSeconds;
uint8_t SensorCounter = 0;



PID ctrl(&Input, &Output, &Setpoint, aggKp, aggKi, aggKd, REVERSE);



#if defined(SSD1306)
U8G2_SSD1306_128X64_NONAME_F_HW_I2C u8g2(U8G2_R0, U8X8_PIN_NONE,
                                                    22, 21);
#elif defined(SH1107)
U8G2_SH1107_64X128_F_HW_I2C u8g2(U8G2_R1, 7);
#else
#error Wrong OLED controller type!
#endif


char F_Buffer[20];

float lastSENSORTmp = 0;
float newSENSORTmp = 0;
uint8_t SENSORTmpTime = 0;


uint16_t vref_adc0, vref_adc1;
ESP32AnalogRead adc_sensor;
ESP32AnalogRead adc_vin;


uint8_t language = 0;


uint8_t hand_side = 0;


FirmwareMSC MSC_Update;
bool MSC_Updating_Flag = false;


Button2 btn;

float limit = 0.0;
void setup();
void loop();
void ROTARYCheck();
void SLEEPCheck();
void SENSORCheck();
void calculateTemp();
void Thermostat();
void beep(uint32_t us, uint16_t frequency);
void setRotary(int rmin, int rmax, int rstep, int rvalue);
int getRotary();
void getEEPROM();
void updateEEPROM();
void MainScreen();
void SetupScreen();
void TipScreen();
void TempScreen();
void TimerScreen();
uint8_t MenuScreen(const char *Items[][language_types], uint8_t numberOfItems,
                   uint8_t selected);
void MessageScreen(const char *Items[][language_types], uint8_t numberOfItems);
uint16_t InputScreen(const char *Items[][language_types]);
void InfoScreen();
void ChangeTipScreen();
void CalibrationScreen();
void InputNameScreen();
void DeleteTipScreen();
void AddTipScreen();
uint16_t denoiseAnalog(byte port);
double getChipTemp();
float getMPUTemp();
uint16_t getVIN();
int32_t variance(int16_t a[]);
void Button_loop();
void PD_Update();
static void usbEventCallback(void *arg, esp_event_base_t event_base,
                             int32_t event_id, void *event_data);
void turnOffHeater(Button2 &b);
void heatWithLimit();
#line 159 "D:/Documents/Songguo-PTS200/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino"
void setup() {
  digitalWrite(PD_CFG_0, LOW);
  digitalWrite(PD_CFG_1, HIGH);
  digitalWrite(PD_CFG_2, LOW);




  Serial.begin(115200);
  Serial.setTxTimeoutMs(0);





  adc_sensor.attach(SENSOR_PIN);
  adc_vin.attach(VIN_PIN);
# 184 "D:/Documents/Songguo-PTS200/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino"
  pinMode(SENSOR_PIN, INPUT_PULLUP);

  pinMode(BUZZER_PIN, OUTPUT);

  pinMode(BUTTON_P_PIN, INPUT_PULLUP);
  pinMode(BUTTON_N_PIN, INPUT_PULLUP);
  pinMode(BUTTON_PIN, INPUT_PULLUP);
# 201 "D:/Documents/Songguo-PTS200/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino"
  init_EEPROM();
  if (digitalRead(BUTTON_P_PIN) == LOW && digitalRead(BUTTON_N_PIN) == LOW &&
      digitalRead(BUTTON_PIN) == HIGH) {
    write_default_EEPROM();
  }
  getEEPROM();

  pinMode(PD_CFG_0, OUTPUT);
  pinMode(PD_CFG_1, OUTPUT);
  pinMode(PD_CFG_2, OUTPUT);

  if (QCEnable) {
    QC.begin();
    delay(100);
    switch (VoltageValue) {
      case 0: {
        QC.set9V();
      } break;
      case 1: {
        QC.set12V();
      } break;
      case 2: {
        QC.set12V();
      } break;
      case 3: {
        QC.set20V();
      } break;
      case 4: {
        QC.set20V();
      } break;
      default:
        break;
    }
  }

  PD_Update();


  delay(100);
  Vin = getVIN();


  SetTemp = DefaultTemp;
  RawTemp = denoiseAnalog(SENSOR_PIN);

  calculateTemp();



  limit = POWER_LIMIT_20;
  if (VoltageValue < 3) {
    limit = POWER_LIMIT_15;
  }
  if (((CurrentTemp + 20) < DefaultTemp) && !inLockMode)
    ledcWrite(CONTROL_CHANNEL, constrain(HEATER_ON, 0, limit));



  ctrl.SetOutputLimits(0, 255);
  ctrl.SetMode(AUTOMATIC);



  a0 = 0;
  b0 = 0;
  setRotary(TEMP_MIN, TEMP_MAX, TEMP_STEP, DefaultTemp);


  sleepmillis = millis();


