Eddddddddy/SolderingPen_2.0/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino.cpp
  beep(500000, 880);

  Serial.println("Soldering Pen");


  Wire.begin();
  Wire.setClock(100000);
  if (accel.begin() == false) {
    delay(500);
    Serial.println("Accelerometer not detected.");
  }






  ChipTemp = getChipTemp();
  lastSENSORTmp = getMPUTemp();
  u8g2.initDisplay();
  u8g2.begin();
  u8g2.sendF("ca", 0xa8, 0x3f);
  u8g2.enableUTF8Print();
  if(hand_side){
    u8g2.setDisplayRotation(U8G2_R3);
  }else{
    u8g2.setDisplayRotation(U8G2_R1);
  }





}

int SENSORCheckTimes = 0;
long lastMillis = 0;

void loop() {
  long timems = millis();
  ROTARYCheck();

  SLEEPCheck();


  if (SENSORCheckTimes > 1) {

    SENSORCheck();



    SENSORCheckTimes = 0;
  }
  SENSORCheckTimes++;

  Thermostat();
  MainScreen();
  lastMillis = millis() - timems;
  Serial.println(lastMillis);
}



void ROTARYCheck() {


  SetTemp = getRotary();

  uint8_t c = digitalRead(BUTTON_PIN);
  if (!c && c0) {
    delay(10);
    if (digitalRead(BUTTON_PIN) == c) {
      beep(100, 880);
      buttonmillis = millis();
      delay(10);
      while ((!digitalRead(BUTTON_PIN)) && ((millis() - buttonmillis) < 500))
        ;
      delay(10);
      if ((millis() - buttonmillis) >= 500) {
        SetupScreen();
      } else {
        if (inLockMode) {
          inLockMode = false;
        } else {
          buttonmillis = millis();
          while ((digitalRead(BUTTON_PIN)) && ((millis() - buttonmillis) < 200))
            delay(10);
          if ((millis() - buttonmillis) >= 200) {
            if (inOffMode) {
              inOffMode = false;
            } else {
              inBoostMode = !inBoostMode;
              if (inBoostMode) {
                boostmillis = millis();
              }
              handleMoved = true;
            }
          } else {
            inOffMode = true;
          }
        }
      }
    }
  }
  c0 = c;


  if (inBoostMode && timeOfBoost) {
    goneSeconds = (millis() - boostmillis) / 1000;
    if (goneSeconds >= timeOfBoost) {
      inBoostMode = false;
      beep(100, 880);
      beepIfWorky = true;

    }
  }
}


void SLEEPCheck() {
  if (inLockMode) {
    ;
  } else {
    if (handleMoved) {
      u8g2.setPowerSave(0);
      if (inSleepMode) {
        limit = POWER_LIMIT_20;
        if (VoltageValue < 3) {
          limit = POWER_LIMIT_15;
        }
        if ((CurrentTemp + 20) <
            SetTemp)
          ledcWrite(
              CONTROL_CHANNEL,
              constrain(HEATER_ON, 0, limit));

        beep(100, 880);
        delayMicroseconds(100);
        beep(100, 880);
        delayMicroseconds(100);
        beepIfWorky = true;

      }
      handleMoved = false;
      inSleepMode = false;

      sleepmillis = millis();
    }


    goneSeconds = (millis() - sleepmillis) / 1000;
    if ((!inSleepMode) && (time2sleep > 0) && (goneSeconds >= time2sleep)) {
      inSleepMode = true;
      beep(100, 880);
    } else if ((!inOffMode) && (time2off > 0) &&
               ((goneSeconds / 60) >= time2off)) {
      inOffMode = true;
      u8g2.setPowerSave(1);
      beep(100, 880);
    }
  }
}



void SENSORCheck() {
# 464 "D:/Documents/Songguo-PTS200/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino"
  if (accel.available()) {
    accels[accelIndex][0] = accel.getRawX() + 32768;
    accels[accelIndex][1] = accel.getRawY() + 32768;
    accels[accelIndex][2] = accel.getRawZ() + 32768;
    accelIndex++;
# 478 "D:/Documents/Songguo-PTS200/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino"
    if (accelIndex >= ACCEL_SAMPLES) {
      accelIndex = 0;

      uint64_t avg[3] = {0, 0, 0};
      for (int i = 0; i < ACCEL_SAMPLES; i++) {
        avg[0] += accels[i][0];
        avg[1] += accels[i][1];
        avg[2] += accels[i][2];
      }
      avg[0] /= ACCEL_SAMPLES;
      avg[1] /= ACCEL_SAMPLES;
      avg[2] /= ACCEL_SAMPLES;
      uint64_t var[3] = {0, 0, 0};
      for (int i = 0; i < ACCEL_SAMPLES; i++) {
        var[0] += (accels[i][0] - avg[0]) * (accels[i][0] - avg[0]);
        var[1] += (accels[i][1] - avg[1]) * (accels[i][1] - avg[1]);
        var[2] += (accels[i][2] - avg[2]) * (accels[i][2] - avg[2]);
      }
      var[0] /= ACCEL_SAMPLES;
      var[1] /= ACCEL_SAMPLES;
      var[2] /= ACCEL_SAMPLES;
# 507 "D:/Documents/Songguo-PTS200/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino"
      int varThreshold = WAKEUPthreshold * 10000;

      if (var[0] > varThreshold || var[1] > varThreshold ||
          var[2] > varThreshold) {
        handleMoved = true;

      }
    }
  }



  ledcWrite(CONTROL_CHANNEL,
            HEATER_OFF);

  if (VoltageValue == 3) {
    delayMicroseconds(TIME2SETTLE_20V);
  } else {
    delayMicroseconds(TIME2SETTLE);
  }
  long timems = millis();
  double temp = denoiseAnalog(SENSOR_PIN);
  lastMillis = millis() - timems;


  if (SensorCounter++ > 10) {
    Vin = getVIN();
    SensorCounter = 0;
  }

  if (!inLockMode) {
    limit = POWER_LIMIT_20;
    if (VoltageValue < 3) {
      limit = POWER_LIMIT_15;
    }
    ledcWrite(CONTROL_CHANNEL,
              constrain(HEATER_PWM, 0,
                        limit));
  }

  RawTemp += (temp - RawTemp) *
             SMOOTHIE;
  calculateTemp();



  if ((ShowTemp != Setpoint) || (abs(ShowTemp - CurrentTemp) > 5))
    ShowTemp = CurrentTemp;
  if (abs(ShowTemp - Setpoint) <= 1) ShowTemp = Setpoint;
  if (inLockMode) {
    ShowTemp = 0;
  }




  gap = abs(SetTemp - CurrentTemp);
  if (gap < 5) {
    if (!isWorky && beepIfWorky) beep(100, 932);
    isWorky = true;
    beepIfWorky = false;
  } else
    isWorky = false;



  if (ShowTemp > 500) TipIsPresent = false;
  if (!TipIsPresent &&
      (ShowTemp < 500)) {
    ledcWrite(CONTROL_CHANNEL, HEATER_OFF);
    beep(100, 880);
    TipIsPresent = true;
    ChangeTipScreen();
    updateEEPROM();
    handleMoved = true;
    RawTemp = denoiseAnalog(
        SENSOR_PIN);
    c0 = LOW;
    setRotary(TEMP_MIN, TEMP_MAX, TEMP_STEP,
              SetTemp);
  }
}



void calculateTemp() {
  if (RawTemp < 200)
    CurrentTemp = map(RawTemp, 0, 200, 15, CalTemp[CurrentTip][0]);
  else if (RawTemp < 280)
    CurrentTemp =
        map(RawTemp, 200, 280, CalTemp[CurrentTip][0], CalTemp[CurrentTip][1]);
  else
    CurrentTemp =
        map(RawTemp, 280, 360, CalTemp[CurrentTip][1], CalTemp[CurrentTip][2]);
}


void Thermostat() {


  if (inOffMode || inLockMode)
    Setpoint = 0;
  else if (inSleepMode)
    Setpoint = SleepTemp;
  else if (inBoostMode) {
    Setpoint = constrain(SetTemp + BoostTemp, 0, 450);
  } else
    Setpoint = SetTemp;

  if (SetTemp != DefaultTemp) {
    DefaultTemp = SetTemp;
    update_default_temp_EEPROM();
  }


