Eddddddddy/SolderingPen_2.0/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino.cpp
  gap = abs(Setpoint - CurrentTemp);
  if (PIDenable) {
    Input = CurrentTemp;
    if (gap < 30)
      ctrl.SetTunings(consKp, consKi, consKd);
    else
      ctrl.SetTunings(aggKp, aggKi, aggKd);
    ctrl.Compute();
  } else {


    if ((CurrentTemp + 0.5) < Setpoint)
      Output = 0;
    else
      Output = 255;
  }
  limit = POWER_LIMIT_20;
  if (VoltageValue < 3) {
    limit = POWER_LIMIT_15;
  } else if(VoltageValue == 3){
    limit = POWER_LIMIT_20_2;
  }
  ledcWrite(CONTROL_CHANNEL,
            constrain((HEATER_PWM), 0, limit));
}


void beep(uint32_t us, uint16_t frequency) {
  if (beepEnable) {
    uint32_t period = 1000000 / ((uint32_t)frequency * 2);
    for (uint32_t t = 0; t < us; t += period * 2) {
      digitalWrite(BUZZER_PIN, HIGH);
      delayMicroseconds(period);
      digitalWrite(BUZZER_PIN, LOW);
      delayMicroseconds(period);
    }
  }
}


void setRotary(int rmin, int rmax, int rstep, int rvalue) {
  countMin = rmin << ROTARY_TYPE;
  countMax = rmax << ROTARY_TYPE;
  countStep = rstep;
  count = rvalue << ROTARY_TYPE;
}


int getRotary() {
  Button_loop();
  return (count >> ROTARY_TYPE);
}



void getEEPROM() { read_EEPROM(); }



void updateEEPROM() { update_EEPROM(); }


void MainScreen() {
  u8g2.firstPage();
  switch(MainScrType) {
  case 2:
    do {
      float fVin = (float)Vin / 1000;
      newSENSORTmp = newSENSORTmp + 0.01 * getMPUTemp();
      SENSORTmpTime++;
      if (SENSORTmpTime >= 100) {
        lastSENSORTmp = newSENSORTmp;
        newSENSORTmp = 0;
        SENSORTmpTime = 0;
      }


      u8g2.setFont(u8g2_font_unifont_t_chinese3);
      u8g2.setFontPosTop();


      u8g2.drawUTF8(0, 0 + SCREEN_OFFSET, "Tmcu         C");
      u8g2.drawUTF8(0, 16 + SCREEN_OFFSET, "Ttip         C");
      u8g2.drawUTF8(0, 32 + SCREEN_OFFSET, "             C");
      u8g2.drawUTF8(0, 48 + SCREEN_OFFSET, "Vbus         V");


      u8g2.setFont(language > 1 ? u8g2_font_unifont_t_chinese3 : PTS200_16);
      char *which_str = (char*)txt_hold[language];
      if (ShowTemp > 500) {
        which_str = (char*)txt_error[language];
      }
      else if (inOffMode || inLockMode) {
        which_str = (char*)txt_off[language];
      }
      else if (inSleepMode) {
        which_str = (char*)txt_sleep[language];
      }
      else if (inBoostMode) {
        which_str = (char*)txt_boost[language];
      }
      else if (isWorky) {
        which_str = (char*)txt_worky[language];
      }
      else if (Output < 180) {
        which_str = (char*)txt_on[language];
      }
      u8g2.drawUTF8(0, 32 + SCREEN_OFFSET, which_str);

      u8g2.setFont(u8g2_font_unifont_t_chinese3);
      u8g2.setCursor(56, 0 + SCREEN_OFFSET);
      u8g2.print(lastSENSORTmp, 2);
      u8g2.setCursor(56, 16 + SCREEN_OFFSET);
      u8g2.print(ShowTemp, 0);
      u8g2.setCursor(56, 32 + SCREEN_OFFSET);
      u8g2.print(Setpoint, 0);
      u8g2.setCursor(56, 48 + SCREEN_OFFSET);
      u8g2.print(fVin, 2);

    } while(u8g2.nextPage());
    break;

  default:
    do {



      u8g2.setFont(PTS200_16);
      if(language == 2){
        u8g2.setFont(u8g2_font_unifont_t_chinese3);
      }
      u8g2.setFontPosTop();

      u8g2.drawUTF8(0, 0 + SCREEN_OFFSET, txt_set_temp[language]);
      u8g2.setCursor(40, 0 + SCREEN_OFFSET);
      u8g2.setFont(u8g2_font_unifont_t_chinese3);
      u8g2.print(Setpoint, 0);

      u8g2.setFont(PTS200_16);
      if(language == 2){
        u8g2.setFont(u8g2_font_unifont_t_chinese3);
      }

      u8g2.setCursor(96, 0 + SCREEN_OFFSET);
      if (ShowTemp > 500)
        u8g2.print(txt_error[language]);
      else if (inOffMode || inLockMode)
        u8g2.print(txt_off[language]);
      else if (inSleepMode)
        u8g2.print(txt_sleep[language]);
      else if (inBoostMode)
        u8g2.print(txt_boost[language]);
      else if (isWorky)
        u8g2.print(txt_worky[language]);
      else if (Output < 180)
        u8g2.print(txt_on[language]);
      else
        u8g2.print(txt_hold[language]);

      u8g2.setFont(u8g2_font_unifont_t_chinese3);

      if (MainScrType) {

        float fVin = (float)Vin / 1000;
        newSENSORTmp = newSENSORTmp + 0.01 * getMPUTemp();
        SENSORTmpTime++;
        if (SENSORTmpTime >= 100) {
          lastSENSORTmp = newSENSORTmp;
          newSENSORTmp = 0;
          SENSORTmpTime = 0;
        }
        u8g2.setCursor(0, 50);
        u8g2.print(lastSENSORTmp, 1);
        u8g2.print(F("C"));
        u8g2.setCursor(83, 50);
        u8g2.print(fVin, 1);
        u8g2.print(F("V"));

        u8g2.setFont(u8g2_font_freedoomr25_tn);
        u8g2.setFontPosTop();
        u8g2.setCursor(37, 18);
        if (ShowTemp > 500)
          u8g2.print(F("000"));
        else
          u8g2.printf("%03d", ShowTemp);
      } else {

        u8g2.setFont(u8g2_font_fub42_tn);
        u8g2.setFontPosTop();
        u8g2.setCursor(15, 20);
        if (ShowTemp > 500)
          u8g2.print(F("000"));
        else
          u8g2.printf("%03d", ShowTemp);
      }
    } while (u8g2.nextPage());
    break;
  }
}


void SetupScreen() {
  ledcWrite(CONTROL_CHANNEL, HEATER_OFF);
  beep(100000, 880);
  uint16_t SaveSetTemp = SetTemp;
  uint8_t selection = 0;
  bool repeat = true;

  while (repeat) {
    selection = MenuScreen(SetupItems, sizeof(SetupItems), selection);
    switch (selection) {
      case 0: {
        TipScreen();
        repeat = false;
      } break;
      case 1: {
        TempScreen();
      } break;
      case 2: {
        TimerScreen();
      } break;



      case 3: {
        MainScrType =
            MenuScreen(MainScreenItems, sizeof(MainScreenItems), MainScrType);
      } break;
      case 4: {
        InfoScreen();
      } break;
      case 5:
        VoltageValue =
            MenuScreen(VoltageItems, sizeof(VoltageItems), VoltageValue);
        PD_Update();
        break;
      case 6:
        QCEnable = MenuScreen(QCItems, sizeof(QCItems), QCEnable);
        break;
      case 7:
        beepEnable = MenuScreen(BuzzerItems, sizeof(BuzzerItems), beepEnable);
        break;
      case 8: {
        restore_default_config = MenuScreen(DefaultItems, sizeof(DefaultItems),
                                            restore_default_config);
        if (restore_default_config) {
          restore_default_config = false;
          write_default_EEPROM();
          read_EEPROM();
        }
      } break;
      case 9: {
        bool lastbutton = (!digitalRead(BUTTON_PIN));
        u8g2.clearBuffer();
        u8g2.setFont(u8g2_font_ncenB08_tr);
        u8g2.drawStr(0, 10,
                     "MSC Update");
        u8g2.sendBuffer();
        delay(1000);
        do {
          MSC_Update.onEvent(usbEventCallback);
          MSC_Update.begin();
          if (lastbutton && digitalRead(BUTTON_PIN)) {
            delay(10);
            lastbutton = false;
          }
        } while (digitalRead(BUTTON_PIN) || lastbutton);

        MSC_Update.end();
      } break;
      case 10: {
        Serial.println(language);
        language = MenuScreen(LanguagesItems, sizeof(LanguagesItems), language);
        Serial.println(language);
        repeat = false;
      } break;
      case 11: {
        if(hand_side == 0){
          u8g2.setDisplayRotation(U8G2_R3);
          hand_side = 1;
        }else{
          u8g2.setDisplayRotation(U8G2_R1);
          hand_side = 0;
        }
        repeat = false;
      } break;
      default:
        repeat = false;
        break;
    }
  }
  updateEEPROM();
  handleMoved = true;
  SetTemp = SaveSetTemp;
  setRotary(TEMP_MIN, TEMP_MAX, TEMP_STEP, SetTemp);
}


void TipScreen() {
  uint8_t selection = 0;
  bool repeat = true;
  while (repeat) {
    selection = MenuScreen(TipItems, sizeof(TipItems), selection);
    switch (selection) {
      case 0:
        ChangeTipScreen();
        break;
      case 1:
        CalibrationScreen();
        break;
      case 2:
        InputNameScreen();
        break;
      case 3:
        DeleteTipScreen();
        break;
      case 4:
        AddTipScreen();
        break;
      default:
        repeat = false;
        break;
    }
  }
}


void TempScreen() {
  uint8_t selection = 0;
  bool repeat = true;
  while (repeat) {
    selection = MenuScreen(TempItems, sizeof(TempItems), selection);
    switch (selection) {
      case 0:
        setRotary(TEMP_MIN, TEMP_MAX, TEMP_STEP, DefaultTemp);
        DefaultTemp = InputScreen(DefaultTempItems);
        break;
      case 1:
        setRotary(50, TEMP_MAX, TEMP_STEP, SleepTemp);
        SleepTemp = InputScreen(SleepTempItems);
        break;
      case 2:
        setRotary(10, 100, TEMP_STEP, BoostTemp);
        BoostTemp = InputScreen(BoostTempItems);
        break;
      default:
        repeat = false;
        break;
    }
  }
}


void TimerScreen() {
  uint8_t selection = 0;
  bool repeat = true;
  while (repeat) {
    selection = MenuScreen(TimerItems, sizeof(TimerItems), selection);
    switch (selection) {
      case 0:
        setRotary(0, 600, 10, time2sleep);
        time2sleep = InputScreen(SleepTimerItems);
        break;
      case 1:
        setRotary(0, 60, 1, time2off);
        time2off = InputScreen(OffTimerItems);
        break;
      case 2:
        setRotary(0, 180, 10, timeOfBoost);
        timeOfBoost = InputScreen(BoostTimerItems);
        break;
      case 3:
        setRotary(0, 50, 5, WAKEUPthreshold);
        WAKEUPthreshold = InputScreen(WAKEUPthresholdItems);
        break;
      default:
        repeat = false;
        break;
    }
  }
}


uint8_t MenuScreen(const char *Items[][language_types], uint8_t numberOfItems,
                   uint8_t selected) {

