Eddddddddy/SolderingPen_2.0/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino.cpp
  if (!digitalRead(BUTTON_P_PIN) && b0 == 1) {
    delay(BUTTON_DELAY);
    if (!digitalRead(BUTTON_P_PIN)) {
      int count0 = count;
      count = constrain(count - countStep, countMin, countMax);
      if (!(countMin == TEMP_MIN && countMax == TEMP_MAX)) {
        if (count0 - countStep < countMin) {
          count = countMax;
        }
      }
      b0 = 0;
    }
  } else if (!digitalRead(BUTTON_P_PIN) && b0 == 0) {
    delay(BUTTON_DELAY);
    if (Button_Time2 > 10)
      count = constrain(count - countStep, countMin, countMax);
    else
      Button_Time2++;
  } else if (digitalRead(BUTTON_P_PIN)) {
    Button_Time2 = 0;
    b0 = 1;
  }
}

void PD_Update() {
  switch (VoltageValue) {
    case 0: {
      digitalWrite(PD_CFG_0, LOW);
      digitalWrite(PD_CFG_1, LOW);
      digitalWrite(PD_CFG_2, LOW);
    } break;
    case 1: {
      digitalWrite(PD_CFG_0, LOW);
      digitalWrite(PD_CFG_1, LOW);
      digitalWrite(PD_CFG_2, HIGH);
    } break;
    case 2: {
      digitalWrite(PD_CFG_0, LOW);
      digitalWrite(PD_CFG_1, HIGH);
      digitalWrite(PD_CFG_2, HIGH);
    } break;
    case 3: {
      digitalWrite(PD_CFG_0, LOW);
      digitalWrite(PD_CFG_1, HIGH);
      digitalWrite(PD_CFG_2, LOW);
    } break;
    case 4: {
      digitalWrite(PD_CFG_0, LOW);
      digitalWrite(PD_CFG_1, HIGH);
      digitalWrite(PD_CFG_2, LOW);
    } break;
    default:
      break;
  }

  if (VoltageValue == 3) {
    ledcSetup(CONTROL_CHANNEL, CONTROL_FREQ_20V, CONTROL_RES);
  } else {
    ledcSetup(CONTROL_CHANNEL, CONTROL_FREQ, CONTROL_RES);
  }

  ledcAttachPin(CONTROL_PIN, CONTROL_CHANNEL);



  ledcWrite(CONTROL_CHANNEL, HEATER_OFF);
}

static void usbEventCallback(void *arg, esp_event_base_t event_base,
                             int32_t event_id, void *event_data) {
  if (event_base == ARDUINO_USB_EVENTS) {

    switch (event_id) {
      case ARDUINO_USB_STARTED_EVENT:

        u8g2.clearBuffer();
        u8g2.setFont(u8g2_font_ncenB08_tr);
        u8g2.drawStr(0, 10,
                     "USB PLUGGED");
        u8g2.sendBuffer();
        break;
      case ARDUINO_USB_STOPPED_EVENT:

        u8g2.clearBuffer();
        u8g2.setFont(u8g2_font_ncenB08_tr);
        u8g2.drawStr(
            0, 10, "USB UNPLUGGED");
        u8g2.sendBuffer();
        break;
      case ARDUINO_USB_SUSPEND_EVENT:


        u8g2.clearBuffer();
        u8g2.setFont(u8g2_font_ncenB08_tr);
        u8g2.drawStr(
            0, 10, "USB SUSPENDED");
        u8g2.sendBuffer();
        break;
      case ARDUINO_USB_RESUME_EVENT:

        u8g2.clearBuffer();
        u8g2.setFont(u8g2_font_ncenB08_tr);
        u8g2.drawStr(0, 10,
                     "USB RESUMED");
        u8g2.sendBuffer();
        break;

      default:
        break;
    }
  } else if (event_base == ARDUINO_FIRMWARE_MSC_EVENTS) {


    switch (event_id) {
      case ARDUINO_FIRMWARE_MSC_START_EVENT:

        u8g2.clearBuffer();
        u8g2.setFont(u8g2_font_ncenB08_tr);
        u8g2.drawStr(
            0, 10,
            "MSC Update Start");
        u8g2.sendBuffer();
        break;
      case ARDUINO_FIRMWARE_MSC_WRITE_EVENT:



        u8g2.clearBuffer();
        u8g2.setFont(u8g2_font_ncenB08_tr);
        u8g2.drawStr(0, 10,
                     "MSC Updating");
        u8g2.sendBuffer();
        break;
      case ARDUINO_FIRMWARE_MSC_END_EVENT:

        u8g2.clearBuffer();
        u8g2.setFont(u8g2_font_ncenB08_tr);
        u8g2.drawStr(
            0, 10, "MSC Update End");
        u8g2.sendBuffer();
        break;
      case ARDUINO_FIRMWARE_MSC_ERROR_EVENT:


        u8g2.clearBuffer();
        u8g2.setFont(u8g2_font_ncenB08_tr);
        u8g2.drawStr(
            0, 10,
            "MSC Update ERROR!");
        u8g2.sendBuffer();
        break;
      case ARDUINO_FIRMWARE_MSC_POWER_EVENT:



        u8g2.clearBuffer();
        u8g2.setFont(u8g2_font_ncenB08_tr);
        u8g2.drawStr(
            0, 10,
            "MSC Update Power");
        u8g2.sendBuffer();
        break;

      default:
        break;
    }
  }
}

void turnOffHeater(Button2 &b) { inOffMode = true; }
# 1692 "D:/Documents/Songguo-PTS200/SolderingPen_ESP32S2/SolderingPen_ESP32S2.ino"
void heatWithLimit() {



  limit = 0;
  if (VoltageValue < 3) {
    limit = POWER_LIMIT_15;
  } else if (VoltageValue == 3) {
    limit = POWER_LIMIT_20;
  }
  ledcWrite(
      CONTROL_CHANNEL,
      constrain(HEATER_PWM, 0, limit));
}